08-ajax/food_trucking/app/views/dishes/index.html.erb

    <footer class="content">
      <div class="likes-count pull-right"><%= dish.likes.count %></div>
---
SELECT COUNT(*) FROM "likes" WHERE "likes"."dish_id" = $1  [["dish_id", 1]]


  $('.star').on('click', function(event){
    var dishId = $(event.target).closest('.ui-card').data('dish-id');
    // make ajax request Dish.find
    $.ajax({
      url: '/api/likes',
      method: 'post',
      beforeSend: function (xhr) {
        xhr.setRequestHeader('X-CSRF-Token', token)
      },
      data: { dish_id: dishId }
    }).done(function(resp){
      // on done function update likes count in dom
      var $likesCount = $(event.target).closest('.ui-card').find('.likes-count');
      $likesCount.text(resp.likes_count);
    });
    // fail(function(){
    //   console.log('error');
    // });
  });
---
SELECT "dishes".* FROM "dishes"