08-ajax/food_trucking/app/views/dishes/show.html.erb

  <article>
  <% @dish.comments.each do |comment| %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."dish_id" = $1  [["dish_id", 1]]