08-ajax/food_trucking/app/controllers/api/dishes_controller.rb

  def index
    @dishes = Dish.all
---
SELECT "dishes".* FROM "dishes"