08-ajax/food_trucking/app/controllers/api/likes_controller.rb

SELECT  "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT $1  [["LIMIT", 1]]
INSERT INTO "likes" ("user_id", "dish_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["dish_id", 1], ["created_at", "2017-10-17 04:25:45.009955"], ["updated_at", "2017-10-17 04:25:45.009955"]]
SELECT COUNT(*) FROM "likes" WHERE "likes"."dish_id" = $1  [["dish_id", 2]]
---
  def create
    like = Like.new
    like.dish_id = params[:dish_id]
    like.user_id = User.first.id
    if like.save
      likes_count = Dish.find(like.dish_id).likes.count