08-ajax/food_trucking/app/controllers/dishes_controller.rb

SELECT "dishes".* FROM "dishes"
---
  def index
    @dishes = Dish.all

SELECT  "dishes".* FROM "dishes" WHERE "dishes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @dish = Dish.find(params[:id])

INSERT INTO "dishes" ("name", "created_at", "updated_at", "image") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Soup"], ["created_at", "2017-10-23 01:21:18.310766"], ["updated_at", "2017-10-23 01:21:18.310766"], ["image", "soup.jpeg"]]
---
  def create
      dish = Dish.new
      dish.name = params[:name]
      dish.image = params[:image]
      dish.save